share/tutorials/heat-transfer/buoyant-pimple/hot_room/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     mousse-buoyant-pimple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;
deltaT          2;
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  no;
maxCo           0.5;

// vim: set ft=foam et sw=2 ts=2 sts=2:
