share/tutorials/heat-transfer/buoyant-pimple/hot_room/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  "rho.*"
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       0;
    relTol          0;
  }
  p_rgh
  {
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-8;
    relTol          0.01;
  }
  p_rghFinal
  {
    $p_rgh;
    relTol          0;
  }
  "(U|h|e|k|epsilon|R)"
  {
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-6;
    relTol          0.1;
  }
  "(U|h|e|k|epsilon|R)Final"
  {
    $U;
    relTol          0;
  }
}
PIMPLE
{
  momentumPredictor yes;
  nOuterCorrectors 1;
  nCorrectors     2;
  nNonOrthogonalCorrectors 0;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
